src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_НастройкиРасположенияИБ/бир_НастройкиРасположенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_НастройкиРасположенияИБ</name>
  <attributes>
    <name>УстановитьЗаголовокСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСообщениеПользователю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияПользователю</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйСтиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьНумерациюОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроизвольныйКод</name>
    <attributes>
      <name>ИмяДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаРегламентныхЗаданий</name>
    <attributes>
      <name>Задание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПользователей</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СброситьПароль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СброситьПользователяОС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаРасширений</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БезопасныйРежим</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗащитаОтОпасныхДействий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияКонстант</name>
    <attributes>
      <name>Константа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_НастройкиРасположенияИБ/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокСтилей();
	
	ОбновитьСписокРасширений();

	ОбновитьСписокРегламентныхЗаданий();

	ОбновитьСписокКонстант();

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтили();
	
	ОтобразитьЦветаГлавногоСтиля();
	
	УстановитьДоступностьЭлементов();

КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если НЕ ЭтаФорма.Модифицированность Тогда
		Возврат;
	КонецЕсли;

	Если бир_РасположениеИБВызовСервера.ГлавныйСтильИзменен(Объект.Ссылка, Объект.ГлавныйСтиль) Тогда
		ПараметрыЗаписи.Вставить("ПредложитьПерезапуск", Истина);
		ПараметрыЗаписи.Вставить("ТекущийГлавныйСтиль",
		                         бир_РасположениеИБВызовСервера.ГлавныйСтильРасположенияИБ(Объект.Ссылка));
		ПараметрыЗаписи.Вставить("НовыйГлавныйСтиль",
		                         Элементы.ГлавныйСтиль.СписокВыбора.НайтиПоЗначению(Объект.ГлавныйСтиль).Представление);
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкаРегламентныхЗаданий.Очистить();
	
	ТабЗаданий = РеквизитФормыВЗначение("НастройкаРегламентныхЗаданий");
	Для Каждого ТекСтрока Из ТабЗаданий Цикл
		Если ТекСтрока.Действие = 2 Тогда
			Продолжить;
		КонецЕсли;
		НовоеЗадание = ТекущийОбъект.НастройкаРегламентныхЗаданий.Добавить();
		НовоеЗадание.Задание  = ТекСтрока.Имя;
		НовоеЗадание.Действие = (ТекСтрока.Действие = 1);
	КонецЦикла;
	
	ТекущийОбъект.НастройкаРасширений.Очистить();
	
	ТабРасширений = РеквизитФормыВЗначение("НастройкаРасширений");
	Для Каждого ТекСтрока Из ТабРасширений Цикл
		Если ТекСтрока.Активность = 2
		   И ТекСтрока.БезопасныйРежим = 2
		   И ТекСтрока.ЗащитаОтОпасныхДействий = 2 Тогда
			Продолжить;
		КонецЕсли;
		НовоеРасширение = ТекущийОбъект.НастройкаРасширений.Добавить();
		НовоеРасширение.Расширение              = ТекСтрока.Имя;
		НовоеРасширение.Активность              = (ТекСтрока.Активность = 1);
		НовоеРасширение.БезопасныйРежим         = (ТекСтрока.БезопасныйРежим = 1);
		НовоеРасширение.ЗащитаОтОпасныхДействий = (ТекСтрока.ЗащитаОтОпасныхДействий = 1);
	КонецЦикла;
	
	ТекущийОбъект.ЗначенияКонстант.Очистить();
	
	ТабКонстант = РеквизитФормыВЗначение("ЗначенияКонстант");
	Для Каждого ТекСтрока Из ТабКонстант Цикл
		Если НЕ ТекСтрока.Изменить Тогда
			Продолжить;
		КонецЕсли;
		НоваяКонстанта = ТекущийОбъект.НастройкаРегламентныхЗаданий.Добавить();
		НоваяКонстанта.Константа = ТекСтрока.Имя;
		НоваяКонстанта.Значение  = ТекСтрока.Изменить;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПредложитьПерезапуск = Ложь;
	Если НЕ ПараметрыЗаписи.Свойство("ПредложитьПерезапуск", ПредложитьПерезапуск) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПредложитьПерезапуск Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон("Изменен стиль для текущего расположения ИБ (""%1"" -> ""%2"").
	                         |Изменения вступят в силу после перезапуска.
							 |
							 |Перезапустить приложение?", ПараметрыЗаписи.ТекущийГлавныйСтиль, ПараметрыЗаписи.НовыйГлавныйСтиль);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерезапуститьПриложение", ЭтаФорма);
	
	ПоказатьВопрос(ОписаниеОповещения,
	               ТекстВопроса,
				   РежимДиалогаВопрос.ДаНет,
				   20,
				   КодВозвратаДиалога.Нет,
				   "Перезапуск приложения",
				   КодВозвратаДиалога.Нет);
	
КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановитьЗаголовокСистемыПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры // УстановитьЗаголовокСистемыПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПользователей

&НаКлиенте
Процедура ПараметрыПользователейПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПараметрыПользователейПриАктивизацииСтроки()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияКонстант

&НаКлиенте
Процедура ЗначенияКонстантПередНачаломИзменения(Элемент, Отказ)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено ИЛИ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.Значение = ПривестиЗначениеКонстантыНаСервере(ТекСтрока.Имя, ТекСтрока.Значение);
	
КонецПроцедуры // ЗначенияКонстантПередНачаломИзменения()

&НаСервереБезКонтекста
Функция ПривестиЗначениеКонстантыНаСервере(Константа, Значение)
	
	Возврат Метаданные.Константы[Константа].Тип.ПривестиЗначение(Значение);
	
КонецФункции // ПривестиЗначениеКонстантыНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроизвольныйКод

&НаКлиенте
Процедура ПроизвольныйКодПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеПроизвольныйКод = ТекСтрока.Код;
	
КонецПроцедуры // ПроизвольныйКодПриАктивизацииСтроки()

&НаКлиенте
Процедура ПолеПроизвольныйКодПриИзменении(Элемент)
	
	ЗаписатьПроизвольныйКодВТаблицу();
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьПроизвольныйКод(Команда)
	
	ЗаписатьПроизвольныйКодВТаблицу();
	
КонецПроцедуры // ЗаписатьПроизвольныйКод()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокРегламентныхЗаданий()
	
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	ИменаЗаданий = Новый Массив();
	Для Каждого ТекЗадание Из МассивЗаданий Цикл
		ИменаЗаданий.Добавить(ТекЗадание.Метаданные.Имя);
	КонецЦикла;

	ТабЗаданий = РеквизитФормыВЗначение("НастройкаРегламентныхЗаданий");
	ТабЗаданий.Очистить();
	Для Каждого ТекСтрока Из Объект.НастройкаРегламентныхЗаданий Цикл
		Если ИменаЗаданий.Найти(ТекСтрока.Задание) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабЗаданий.Добавить();
		НоваяСтрока.Имя      = ТекСтрока.Задание;
		НоваяСтрока.Действие = ?(ТекСтрока.Действие, 1, 0);
	КонецЦикла;
	
	Для Каждого ТекЗадание Из МассивЗаданий Цикл
		ДобавленныеСтроки = ТабЗаданий.НайтиСтроки(Новый Структура("Имя", ТекЗадание.Метаданные.Имя));
		Если ДобавленныеСтроки.Количество() > 0 Тогда
			ДобавленныеСтроки[0].Представление = ТекЗадание.Метаданные.Представление(); 
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабЗаданий.Добавить();
		НоваяСтрока.Имя           = ТекЗадание.Метаданные.Имя;
		НоваяСтрока.Представление = ТекЗадание.Метаданные.Представление();
		НоваяСтрока.Действие      = 2;
	КонецЦикла;
	
	ТабЗаданий.Сортировать("Представление");
	
	ЗначениеВРеквизитФормы(ТабЗаданий, "НастройкаРегламентныхЗаданий");
	
КонецПроцедуры // ОбновитьСписокРегламентныхЗаданий()

&НаСервере
Процедура ОбновитьСписокРасширений()
	
	МассивРасширений = РасширенияКонфигурации.Получить(, ИсточникРасширенийКонфигурации.БазаДанных);
	ИменаРасширений = Новый Массив();
	Для Каждого ТекРасширение Из МассивРасширений Цикл
		ИменаРасширений.Добавить(ТекРасширение.Имя);
	КонецЦикла;

	ТабРасширений = РеквизитФормыВЗначение("НастройкаРасширений");
	ТабРасширений.Очистить();
	Для Каждого ТекСтрока Из Объект.НастройкаРасширений Цикл
		Если ИменаРасширений.Найти(ТекСтрока.Расширение) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабРасширений.Добавить();
		НоваяСтрока.Имя                     = ТекСтрока.Расширение;
		НоваяСтрока.Активность              = ?(ТекСтрока.Активность, 1, 0);
		НоваяСтрока.БезопасныйРежим         = ?(ТекСтрока.БезопасныйРежим, 1, 0);
		НоваяСтрока.ЗащитаОтОпасныхДействий = ?(ТекСтрока.ЗащитаОтОпасныхДействий, 1, 0);
	КонецЦикла;
	
	Для Каждого ТекРасширение Из МассивРасширений Цикл
		ДобавленныеСтроки = ТабРасширений.НайтиСтроки(Новый Структура("Имя", ТекРасширение.Имя));
		Если ДобавленныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабРасширений.Добавить();
		НоваяСтрока.Имя                     = ТекРасширение.Имя;
		НоваяСтрока.Активность              = 2;
		НоваяСтрока.БезопасныйРежим         = 2;
		НоваяСтрока.ЗащитаОтОпасныхДействий = 2;
	КонецЦикла;
	
	ТабРасширений.Сортировать("Имя");
	
	ЗначениеВРеквизитФормы(ТабРасширений, "НастройкаРасширений");
	
КонецПроцедуры // ОбновитьСписокРасширений()

&НаСервере
Процедура ОбновитьСписокКонстант()
	
	ИменаКонстант = Новый Массив();
	Для Каждого ТекКонстанта Из Метаданные.Константы Цикл
		ЕстьТип = Ложь;
		Для Каждого ТекТип Из ТекКонстанта.Тип.Типы() Цикл
			Если Метаданные.Справочники.бир_НастройкиРасположенияИБ.ТабличныеЧасти.ЗначенияКонстант.Реквизиты.Значение.Тип.СодержитТип(ТекТип) Тогда
				ЕстьТип = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьТип Тогда
			Продолжить;
		КонецЕсли;
		ИменаКонстант.Добавить(ТекКонстанта.Имя);
	КонецЦикла;

	ТабКонстант = РеквизитФормыВЗначение("ЗначенияКонстант");
	ТабКонстант.Очистить();
	Для Каждого ТекСтрока Из Объект.ЗначенияКонстант Цикл
		Если ИменаКонстант.Найти(ТекСтрока.Константа) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабКонстант.Добавить();
		НоваяСтрока.Имя      = ТекСтрока.Константа;
		НоваяСтрока.Значение = ТекСтрока.Значение;
	КонецЦикла;
	
	Для Каждого ТекКонстанта Из ИменаКонстант Цикл
		МетаКонстанта = Метаданные.Константы[ТекКонстанта];
		
		ДобавленныеСтроки = ТабКонстант.НайтиСтроки(Новый Структура("Имя", ТекКонстанта));
		Если ДобавленныеСтроки.Количество() > 0 Тогда
			ДобавленныеСтроки[0].Представление = МетаКонстанта.Представление(); 
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабКонстант.Добавить();
		НоваяСтрока.Имя           = ТекКонстанта;
		НоваяСтрока.Представление = МетаКонстанта.Представление();
		НоваяСтрока.Значение      = Константы[ТекКонстанта].Получить();
	КонецЦикла;
	
	ТабКонстант.Сортировать("Представление");
	
	ЗначениеВРеквизитФормы(ТабКонстант, "ЗначенияКонстант");
	
КонецПроцедуры // ОбновитьСписокКонстант()

&НаКлиенте
Процедура ЗаписатьПроизвольныйКодВТаблицу()
	
	ТекущаяСтрока = Элементы.ПроизвольныйКод.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Элементы.ПроизвольныйКод.ТекущиеДанные.Код = ПолеПроизвольныйКод;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьПроизвольныйКодВТаблицу()

&НаСервере
Процедура ЗаполнитьСписокСтилей()
	
	Элементы.ГлавныйСтиль.СписокВыбора.Добавить("ОСНОВНОЙ", "Основной");
	
	Для Каждого ТекСтиль Из Метаданные.Стили Цикл
		Элементы.ГлавныйСтиль.СписокВыбора.Добавить(ТекСтиль.Имя, ТекСтиль.Представление());
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокСтилей()

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ЗаголовокСистемы.Видимость = Объект.УстановитьЗаголовокСистемы;
	
КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаКлиенте
Процедура ГлавныйСтильПриИзменении(Элемент)
	
	ОтобразитьЦветаГлавногоСтиля();
	
КонецПроцедуры // ГлавныйСтильПриИзменении()

&НаКлиенте
Процедура ОтобразитьЦветаГлавногоСтиля()
	
	Элементы.ДекорацияЦветАктивности.ЦветФона              = Новый Цвет();
	Элементы.ДекорацияЦветАкцентирования.ЦветФона          = Новый Цвет();
	Элементы.ДекорацияЦветНавигации.ЦветФона               = Новый Цвет();
	Элементы.ДекорацияЦветНавигацииДополнительный.ЦветФона = Новый Цвет();
	Элементы.ДекорацияЦветВажного.ЦветФона                 = Новый Цвет();
	
	Если ПустаяСтрока(Объект.ГлавныйСтиль) ИЛИ НЕ Стили.Свойство(Объект.ГлавныйСтиль) Тогда
		Возврат;
	КонецЕсли;
	
	ВремЦвета = Стили[Объект.ГлавныйСтиль];
	
	Элементы.ДекорацияЦветАктивности.ЦветФона              = ВремЦвета.ЦветАктивности;
	Элементы.ДекорацияЦветАкцентирования.ЦветФона          = ВремЦвета.ЦветАкцентирования;
	Элементы.ДекорацияЦветНавигации.ЦветФона               = ВремЦвета.ЦветНавигации;
	Элементы.ДекорацияЦветНавигацииДополнительный.ЦветФона = ВремЦвета.ЦветНавигацииДополнительный;
	Элементы.ДекорацияЦветВажного.ЦветФона                 = ВремЦвета.ЦветВажного;

КонецПроцедуры // ОтобразитьЦветаГлавногоСтиля()

// сонар:MagicNumber:выкл
&НаКлиенте
Процедура ЗаполнитьСтили()

	Стили = Новый Структура();
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(250, 204, 31));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(0, 150, 70));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(251, 237, 158));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(255, 255, 217));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(255, 255, 0));
	Стили.Вставить("Основной", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(85, 145, 195));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(105, 75, 0));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(240, 235, 215));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(255, 250, 240));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(250, 220, 155));
	Стили.Вставить("бир_Бежевый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(170, 220, 235));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(10, 90, 135));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(180, 220, 240));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(210, 240, 255));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(70, 150, 180));
	Стили.Вставить("бир_Голубой", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(170, 200, 150));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(0, 150, 70));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(175, 240, 185));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(225, 255, 220));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(120, 200, 120));
	Стили.Вставить("бир_Зеленый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(255, 110, 180));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(255, 110, 180));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(215, 90, 155));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(215, 155, 195));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(255, 110, 180));
	Стили.Вставить("бир_Розовый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(105, 170, 185));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(0, 115, 170));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(220, 225, 230));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(150, 145, 155));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(0, 115, 170));
	Стили.Вставить("бир_СероГолубой", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(170, 170, 170));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(0, 0, 0));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(204, 204, 204));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(224, 224, 224));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(0, 0, 0));
	Стили.Вставить("бир_Серый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(30, 144, 255));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(65, 105, 225));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(80, 120, 160));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(100, 150, 210));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(80, 120, 160));
	Стили.Вставить("бир_Синий", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(120, 40, 75));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(105, 90, 75));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(115, 100, 150));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(140, 115, 140));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(80, 105, 155));
	Стили.Вставить("бир_Сиреневый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(70, 70, 70));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(70, 70, 70));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(50, 50, 50));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(90, 90, 90));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(90, 90, 90));
	Стили.Вставить("бир_ТемноСерый", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(190, 115, 155));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(220, 100, 220));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(235, 130, 255));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(254, 215, 255));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(180, 140, 250));
	Стили.Вставить("бир_Фуксия", ВремЦвета);
	
	ВремЦвета = Новый Структура();
	ВремЦвета.Вставить("ЦветАктивности", Новый Цвет(125, 170, 75));
	ВремЦвета.Вставить("ЦветАкцентирования", Новый Цвет(115, 155, 65));
	ВремЦвета.Вставить("ЦветНавигации", Новый Цвет(95, 120, 50));
	ВремЦвета.Вставить("ЦветНавигацииДополнительный", Новый Цвет(120, 155, 65));
	ВремЦвета.Вставить("ЦветВажного", Новый Цвет(110, 135, 60));
	Стили.Вставить("бир_Хаки", ВремЦвета);


КонецПроцедуры // ЗаполнитьСтили()
// сонар:MagicNumber:вкл

&НаКлиенте
Процедура ПерезапуститьПриложение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры // ПерезапуститьПриложение()

#КонецОбласти
